# UIThemeManager Properties

---
The UIThemeManager type exposes the following members.
| Name| Description
---|---|---
| CurrentCanvasTheme|  current canvas theme.
| CurrentTheme|  The current overall theme which impacts the Revit frame and canvas.
| FollowSystemColorTheme|  Indicate if the overall theme follows operating system color theme.
Top
#### Reference
UIThemeManager Class
Autodesk.Revit.UI Namespace